aaron-bond.better-comments
alefragnani.bookmarks
amazonwebservices.aws-toolkit-vscode
ambar.bundle-size
antfu.file-nesting
antfu.smart-clicks
anthropic.claude-code
apollographql.vscode-apollo
arcanis.vscode-zipfs
be5invis.vscode-custom-css
bierner.emojisense
bmewburn.vscode-intelephense-client
bradlc.vscode-tailwindcss
christopherstyles.html-entities
coderabbit.coderabbit-vscode
csstools.postcss
dart-code.dart-code
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
denoland.vscode-deno
docker.docker
docsmsft.docs-markdown
docsmsft.docs-preview
donjayamanne.githistory
dracula-theme-pro.theme-dracula-pro
dracula-theme.theme-dracula
drknoxy.eslint-disable-snippets
dsznajder.es7-react-js-snippets
eamodio.gitlens
ecmel.vscode-html-css
eg2.vscode-npm-script
eriklynd.json-tools
esbenp.prettier-vscode
figstack.vsc
firefox-devtools.vscode-firefox-debug
formulahendry.auto-rename-tag
github.codespaces
github.copilot-chat
github.vscode-github-actions
github.vscode-pull-request-github
graphql.vscode-graphql
graphql.vscode-graphql-execution
graphql.vscode-graphql-syntax
gruntfuggly.todo-tree
hashicorp.terraform
heybourn.headwind
hookyqr.beautify
htmlhint.vscode-htmlhint
ibm.output-colorizer
icrawl.discord-vscode
kamikillerto.vscode-colorize
kumar-harsh.graphql-for-vscode
mechatroner.rainbow-csv
mikestead.dotenv
mjmlio.vscode-mjml
ms-azuretools.vscode-azureresourcegroups
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-dotnettools.vscode-dotnet-runtime
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.remote-explorer
ms-vscode.remote-server
nixon.env-cmd-file-syntax
nrwl.angular-console
openai.chatgpt
orta.vscode-jest
oven.bun-vscode
pnp.polacode
pulkitgangwar.nextjs-snippets
quicktype.quicktype
rangav.vscode-thunder-client
reactreedev.reactree
redhat.vscode-commons
redhat.vscode-yaml
rust-lang.rust-analyzer
saoudrizwan.claude-dev
seatonjiang.gitmoji-vscode
shopify.theme-check-vscode
silvenon.mdx
sissel.shopify-liquid
sleistner.vscode-fileutils
statelyai.stately-vscode
stkb.rewrap
svelte.svelte-vscode
tabnine.tabnine-vscode
tamasfe.even-better-toml
tamj0rd2.ts-quickfixes-extension
threadheap.serverless-ide-vscode
unifiedjs.vscode-mdx
usernamehw.errorlens
vivaxy.vscode-conventional-commits
vscode-icons-team.vscode-icons
wayou.vscode-todo-highlight
wix.glean
wix.vscode-import-cost
wmaurer.change-case
yzhang.markdown-all-in-one
zamerick.vscode-caddyfile-syntax
